fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированныхПремий/ВКМ_НачислениеФиксированныхПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированныхПремий</name>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>ВКМ_НачисленияПремии</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Должность</name>
      <type>
        <types>CatalogRef.ВКМ_ДолжностиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_Удержания</types>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
        <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ВКМ_Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_Премия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_Должность</name>
    <type>
      <types>CatalogRef.ВКМ_ДолжностиСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>ВКМ_Начислено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_НДФЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_Должность</name>
    <type>
      <types>CatalogRef.ВКМ_ДолжностиСотрудников</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированныхПремий/ObjectModule.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

     РассчитатьДвиженияПремии(); 
         
КонецПроцедуры

Процедура РассчитатьДвиженияПремии()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
		|	ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.ВКМ_Должность КАК ВКМ_Должность,
		|	ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.ВКМ_ВидРасчета КАК ВидРасчета,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Премия КАК ВКМ_Премия
		|ИЗ
		|	Документ.ВКМ_НачислениеФиксированныхПремий.ВКМ_НачисленияПремии КАК ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.ВКМ_Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник
		|			И ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.ВКМ_Должность = ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Должность
		|ГДЕ
		|	ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.Ссылка = &Ссылка
		|	И ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.ВКМ_ВидРасчета = &Премия";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Премия", ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.РазоваяПремия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		 Если ТипЗнч(ВыборкаДетальныеЗаписи.ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда
			Продолжить;
		КонецЕсли;
		
	    Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;  
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		
		Движение.ВКМ_Начислено = ВыборкаДетальныеЗаписи.ВКМ_Премия;
		Движение.ВКМ_НДФЛ = ВыборкаДетальныеЗаписи.ВКМ_Премия * 13 / 100;   
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();  
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ВКМ_Сотрудник = ВыборкаДетальныеЗаписи.ВКМ_Сотрудник;
		Движение.Сумма = ВыборкаДетальныеЗаписи.ВКМ_Премия - (ВыборкаДетальныеЗаписи.ВКМ_Премия * 13 / 100);
				
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры    

#КонецОбласти
